<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpId;
                helpId = window.location.hash.substring(1);
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                }
            }
        }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription", class="largesize">
        <h2>Vyhledat nejbližší lokalitu</h2><p/>
        <h2></h2>
        <hr/>
    <p>Tento n&aacute;stroj vyhled&aacute;v&aacute; nejbliž&scaron;&iacute; prvky a volitelně i vytv&aacute;ř&iacute; přehledy a seřazuje vzd&aacute;lenosti k nejbliž&scaron;&iacute;m prvkům. K nalezen&iacute; nejbliž&scaron;&iacute;ch prvků lze použ&iacute;t vzd&aacute;lenost vzdu&scaron;nou čarou, vzd&aacute;lenost po silnici nebo dobu j&iacute;zdy. K dispozici jsou možnosti pro omezen&iacute; počtu hledan&yacute;ch nejbliž&scaron;&iacute;ch prvků nebo omezen&iacute; rozmez&iacute; pro vyhled&aacute;v&aacute;n&iacute;. V&yacute;sledky anal&yacute;zy tohoto n&aacute;stroje mohou zodpovědět např&iacute;klad na n&aacute;sleduj&iacute;c&iacute; ot&aacute;zky:
        <ul>
            <li>Kter&yacute; park je odsud nejbl&iacute;že?
            </li>
            <li>Do kter&eacute; nemocnice se dostanu za nejkrat&scaron;&iacute; dobu j&iacute;zdy? Jak dlouho by tato cesta trvala v 17:30 v &uacute;ter&yacute; v dopravn&iacute; &scaron;pičce?
            </li>
            <li>Jak&aacute; je silničn&iacute; vzd&aacute;lenost mezi těmito hlavn&iacute;mi městy?
            </li>
            <li>Kteř&iacute; z těchto pacientů bydl&iacute; ve vzd&aacute;lenosti do dvou kilometrů od těchto chemick&yacute;ch z&aacute;vodů?
            </li>
        </ul>
        
    </p>
    <p>Funkce Vyhledat nejbliž&scaron;&iacute; lokalitu vr&aacute;t&iacute; vrstvu obsahuj&iacute;c&iacute; nejbliž&scaron;&iacute; prvky a volitelně i vrstvu lini&iacute;, kter&aacute; spojuje poč&aacute;tečn&iacute; um&iacute;stěn&iacute; s př&iacute;slu&scaron;n&yacute;mi nejbliž&scaron;&iacute;mi um&iacute;stěn&iacute;mi. Tato voliteln&aacute; vrstva lini&iacute; obsahuje informace o poč&aacute;tečn&iacute;ch a nejbliž&scaron;&iacute;ch um&iacute;stěn&iacute;ch a jejich vz&aacute;jemn&yacute;ch vzd&aacute;lenostech.
    </p>
    <p>Pokud je za&scaron;krtnuto pole 
        <b>Použ&iacute;vat rozsah aktu&aacute;ln&iacute; mapy</b>, budou jako poč&aacute;tečn&iacute; a potenci&aacute;ln&iacute; nejbliž&scaron;&iacute; prvky považov&aacute;ny pouze prvky viditeln&eacute; v&nbsp;rozsahu aktu&aacute;ln&iacute; mapy. Pokud pole za&scaron;krtnuto nen&iacute;, budou považov&aacute;ny v&scaron;echny prvky ve vstupn&iacute; vrstvě, včetně těch, kter&eacute; se nach&aacute;z&iacute; mimo rozsah aktu&aacute;ln&iacute; mapy.
        
        
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="NearbyLocationsLayer">
        <div><h2>Vyhledat nejbližší lokality v</h2></div>
        <hr/>
        <div>
            <p>Funkce Vyhledat nejbliž&scaron;&iacute; lokalitu měř&iacute; z každ&eacute;ho um&iacute;stěn&iacute; ve vstupn&iacute; vrstvě do um&iacute;stěn&iacute; v t&eacute;to vrstvě. Tento n&aacute;stroj podporuje až 1 000 um&iacute;stěn&iacute; v každ&eacute; vrstvě.
            </p>
        </div>
    </div>
    <div id="MeasurementMethod">
        <div><h2>Měření</h2></div>
        <hr/>
        <div>
            <p>Umožňuje vybrat, zda maj&iacute; b&yacute;t nejbliž&scaron;&iacute; um&iacute;stěn&iacute; hled&aacute;ny na z&aacute;kladě vzd&aacute;lenosti vzdu&scaron;nou čarou, j&iacute;zdn&iacute; vzd&aacute;lenosti nebo doby j&iacute;zdy. V př&iacute;padech j&iacute;zdn&iacute; vzd&aacute;lenosti a doby j&iacute;zdy jsou vzd&aacute;lenosti měřeny po silnic&iacute;ch a respektuj&iacute; jednosměrn&eacute; silnice, nepovolen&eacute; man&eacute;vry atd. 
            </p>
            <p>Pokud hled&aacute;te nejbliž&scaron;&iacute; lokality pomoc&iacute; vzd&aacute;lenosti vzdu&scaron;nou čarou, můžete jako vstupn&iacute; prvky použ&iacute;t body, linie nebo oblasti. Chcete-li hledat pomoc&iacute; doby j&iacute;zdy nebo j&iacute;zdn&iacute; vzd&aacute;lenosti, mus&iacute; obě vstupn&iacute; vrstvy (vstupn&iacute; vrstva a vrstva nejbliž&scaron;&iacute;ch lokalit) obsahovat body. 
            </p>
            <p>Pokud měř&iacute;te mezi liniemi nebo oblastmi, je hled&aacute;na vzd&aacute;lenost od nejbliž&scaron;&iacute;ho bodu nebo do něj pod&eacute;l linie nebo hranice oblasti. 
            </p>
        </div>
    </div>
    <div id="Cutoffs">
        <div><h2>Pro každou lokalitu ve</h2></div>
        <hr/>
        <div>
            
            <p>K dispozici jsou dvě možnosti pro omezen&iacute; vyhled&aacute;v&aacute;n&iacute; nejbliž&scaron;&iacute;ch lokalit. Prvn&iacute; možnost&iacute; je omezen&iacute; maxim&aacute;ln&iacute;ho počtu nejbliž&scaron;&iacute;ch um&iacute;stěn&iacute;, kter&eacute; chcete naj&iacute;t pro jedno poč&aacute;tečn&iacute; um&iacute;stěn&iacute;. Můžete tak např&iacute;klad zvolit, aby byl vyhled&aacute;v&aacute;n jeden nejbliž&scaron;&iacute; park, dva nejbliž&scaron;&iacute; parky atd. Druhou možnost&iacute; je nastaven&iacute; maxim&aacute;ln&iacute; j&iacute;zdn&iacute; vzd&aacute;lenosti nebo doby j&iacute;zdy.
            </p>
            <p>Pokud tyto možnosti neza&scaron;krtnete, bude maxim&aacute;ln&iacute; počet nejbliž&scaron;&iacute;ch hledan&yacute;ch lokalit nastaven na 100 (maximum n&aacute;stroje) a maxim&aacute;ln&iacute; rozmez&iacute; pro vyhled&aacute;v&aacute;n&iacute; bude neomezen&eacute;.
            </p>
            <p>Doba zpracov&aacute;n&iacute; z&aacute;lež&iacute; na počtu poč&aacute;tečn&iacute;ch um&iacute;stěn&iacute;, počtu nejbliž&scaron;&iacute;ch um&iacute;stěn&iacute; a maxim&aacute;ln&iacute;m rozmez&iacute; pro vyhled&aacute;v&aacute;n&iacute;. Vět&scaron;&iacute; množstv&iacute; um&iacute;stěn&iacute; nebo rozs&aacute;hlej&scaron;&iacute; rozmez&iacute; pro vyhled&aacute;v&aacute;n&iacute; prodlužuj&iacute; dobu zpracov&aacute;n&iacute;.
                
            </p>
            <p>Berte na vědom&iacute;, že pokud je nastaveno omezen&iacute; rozmez&iacute; pro vyhled&aacute;v&aacute;n&iacute;, může se st&aacute;t, že n&aacute;stroj nenalezne ž&aacute;dn&aacute; nejbliž&scaron;&iacute; um&iacute;stěn&iacute;. Může se tak&eacute; st&aacute;t, že nalezne men&scaron;&iacute; než maxim&aacute;ln&iacute; zadan&yacute; počet nejbliž&scaron;&iacute;ch um&iacute;stěn&iacute;.
            </p>
            
        </div>
    </div>
    <div id="UseTypicalTraffic">
        <div><h2>Použít obvyklé dopravní podmínky pro</h2></div>
        <hr/>
        <div>
            <p>
                Při měřen&iacute; doby j&iacute;zdy se mohou nejbliž&scaron;&iacute; prvky odv&iacute;jet od dopravn&iacute;ch podm&iacute;nek a času dne. Představte si, že hled&aacute;te nejbliž&scaron;&iacute; l&eacute;kařskou pohotovost v dopravn&iacute; &scaron;pičce. V rann&iacute; dopravn&iacute; &scaron;pičce m&aacute; př&iacute;choz&iacute; provoz směřuj&iacute;c&iacute; k centru města tendenci pohybovat se pomaleji, než odchoz&iacute; provoz. Nejbliž&scaron;&iacute; zař&iacute;zen&iacute; se tak v tento čas dne může nach&aacute;zet ve směru odchoz&iacute;ho provozu. Ve večern&iacute;ch hodin&aacute;ch je př&iacute;choz&iacute; provoz rychlej&scaron;&iacute;, nejbliž&scaron;&iacute; zař&iacute;zen&iacute; tedy může b&yacute;t &uacute;plně jin&eacute; zař&iacute;zen&iacute; ve směru př&iacute;choz&iacute;ho provozu.
            </p>
            <p>Pokud za&scaron;krtnete pole 
                <b>Použ&iacute;t obvykl&eacute; dopravn&iacute; podm&iacute;nky pro</b> a urč&iacute;te den a čas, vyhled&aacute; n&aacute;stroj nejbliž&scaron;&iacute; prvky na z&aacute;kladě historick&yacute;ch rychlostn&iacute;ch průměrů pětiminutov&yacute;ch intervalů v průběhu běžn&eacute;ho t&yacute;dne. Nejbliž&scaron;&iacute; prvky se budou li&scaron;it v z&aacute;vislosti na kol&iacute;s&aacute;n&iacute; dopravn&iacute;ch podm&iacute;nek (a t&iacute;m tak&eacute; doby cesty) v průběhu t&yacute;dne.
            </p>
            <p>Mějte na paměti, že jak se vozidlo vzdaluje z v&yacute;choz&iacute;ho bodu, plyne i čas a měn&iacute; se dopravn&iacute; podm&iacute;nky. Tento n&aacute;stroj k tomu přihl&iacute;ž&iacute;, použ&iacute;v&aacute;te-li dopravn&iacute; data. Ne v&scaron;echny regiony v&scaron;ak dopravn&iacute; data podporuj&iacute;. Chcete-li zjistit, zda jsou tato data dostupn&aacute; ve va&scaron;&iacute; oblasti studie, klikněte v tomto n&aacute;stroji na odkaz 
                <b>Zobrazit dostupnost</b>.
            </p>
            <p>Chcete-li vyhledat nejbliž&scaron;&iacute; prvky na z&aacute;kladě pevn&yacute;ch rychlost&iacute;, jako jsou např&iacute;klad rychlostn&iacute; omezen&iacute;, zru&scaron;te za&scaron;krtnut&iacute; pole 
                <b>Použ&iacute;t obvykl&eacute; dopravn&iacute; podm&iacute;nky pro</b>. Neza&scaron;krtnut&iacute; t&eacute;to možnosti je vhodn&eacute; v př&iacute;padě, že chcete zjistit, kter&eacute; prvky jsou obecně nejbl&iacute;že, nikoliv kter&eacute; prvky jsou nejbl&iacute;že podle dan&yacute;ch dopravn&iacute;ch podm&iacute;nek a určen&eacute;ho času a dne.
            </p>
        </div>
    </div>
    <div id="UseTraffic">
        <div><h2>Použít dopravu</h2></div>
        <hr/>
        <div>
            <p>Pokud zvol&iacute;te 
                <b>J&iacute;zdn&iacute; čas</b>, m&aacute;te k dispozici několik možnost&iacute;, jak měřit dobu j&iacute;zdy.
                <ul>
                    <li>
                        <p>Chcete-li vyhledat nejbliž&scaron;&iacute; prvky na z&aacute;kladě pevn&yacute;ch rychlost&iacute;, jako jsou např&iacute;klad rychlostn&iacute; omezen&iacute;, a nikoliv na z&aacute;kladě proměnliv&yacute;ch rychlost&iacute; způsoben&yacute;ch měn&iacute;c&iacute;mi se dopravn&iacute;mi podm&iacute;nkami, zru&scaron;te za&scaron;krtnut&iacute; pole 
                            <b>Použ&iacute;t dopravu</b>. Neza&scaron;krtnut&iacute; t&eacute;to možnosti je vhodn&eacute; v př&iacute;padě, že chcete zjistit, kter&eacute; prvky jsou obecně nejbl&iacute;že, nikoliv kter&eacute; prvky jsou nejbl&iacute;že podle dan&yacute;ch dopravn&iacute;ch podm&iacute;nek a určen&eacute;ho času a dne.
                        </p>
                    </li>
                    <li>
                        <p>Chcete-li vyhledat nejbliž&scaron;&iacute; prvky na z&aacute;kladě dan&eacute;ho poč&aacute;tečn&iacute;ho času a měn&iacute;c&iacute;ch se dopravn&iacute;ch podm&iacute;nek, za&scaron;krtněte možnost 
                            <b>Použ&iacute;t dopravu</b>. Pokud tak&eacute; zvol&iacute;te možnost
                            <b>Aktu&aacute;ln&iacute; dopravn&iacute; podm&iacute;nky</b>, bude čas odjezdu z poč&aacute;tečn&iacute;ch um&iacute;stěn&iacute; nastaven na aktu&aacute;ln&iacute; čas a při určov&aacute;n&iacute; nejbliž&scaron;&iacute;ch prvků budou použ&iacute;v&aacute;ny aktu&aacute;ln&iacute; a předpov&iacute;dan&eacute; rychlosti dopravy z&iacute;skan&eacute; ze zdrojů a čidel. Předpov&iacute;dan&eacute; rychlosti dopravy jsou vypoč&iacute;t&aacute;ny na z&aacute;kladě aktu&aacute;ln&iacute;ch rychlost&iacute; provozu, historick&yacute;ch rychlost&iacute; a aktu&aacute;ln&iacute;ch ud&aacute;lost&iacute;, např&iacute;klad počas&iacute;. Rychlosti dopravy jsou předpov&iacute;d&aacute;ny na 12 hodin dopředu, takže můžete přesunut&iacute;m posuvn&iacute;ku nastavit čas odjezdu až o 12 hodin dopředu.
                        </p>
                        <p>Tato nastaven&iacute; aktu&aacute;ln&iacute; dopravy jsou vhodn&aacute;, chcete-li zjistit, ke kter&yacute;m prvkům se lze dostat v nejkrat&scaron;&iacute;m možn&eacute;m čase, vyjedete-li okamžitě, za jednu hodinu atd.
                        </p>
                    </li>
                    <li>
                        <p>Pokud za&scaron;krtnete pole 
                            <b>Použ&iacute;t dopravu</b> a vyberete možnost
                            <b>Obvykl&eacute; dopravn&iacute; podm&iacute;nky pro</b> den a čas, vyhled&aacute; n&aacute;stroj nejbliž&scaron;&iacute; prvky na z&aacute;kladě historick&yacute;ch rychlostn&iacute;ch průměrů pětiminutov&yacute;ch intervalů v průběhu běžn&eacute;ho t&yacute;dne. V&yacute;sledky přihl&iacute;žej&iacute; k hustotě dopravy, neberou v&scaron;ak v potaz vliv aktu&aacute;ln&iacute;ch dopravn&iacute;ch podm&iacute;nek a ud&aacute;lost&iacute;, kter&eacute; se mohou v&yacute;razně li&scaron;it od normy.
                        </p>
                        <p>
                            Pomoc&iacute; těchto historick&yacute;ch dopravn&iacute;ch nastaven&iacute; se např&iacute;klad můžete zeptat na ot&aacute;zku, &bdquo;Ke kter&yacute;m prvkům se mohu obyčejně nejrychleji dostat, pokud vyjedu v 11:30 ve středu?&ldquo;
                        </p>
                        <p>Nastaven&yacute; čas se ř&iacute;d&iacute; časov&yacute;m p&aacute;smem, ve kter&eacute;m se nach&aacute;z&iacute; poč&aacute;tečn&iacute; prvky. Pokud tedy nastav&iacute;te čas na 8:00 a m&aacute;te dva poč&aacute;tečn&iacute; prvky, jeden v New York City a druh&yacute; v Los Angeles, budou nejbliž&scaron;&iacute; um&iacute;stěn&iacute; hled&aacute;ny pro předpokl&aacute;dan&yacute; čas odjezdu 8:00 v&yacute;chodn&iacute;ho času a 8:00 tichomořsk&eacute;ho času.
                        </p>
                    </li>
                </ul>
                Mějte na paměti, že jak se vozidlo vzdaluje z v&yacute;choz&iacute;ho bodu, plyne i čas a měn&iacute; se dopravn&iacute; podm&iacute;nky. Tento n&aacute;stroj k tomu přihl&iacute;ž&iacute;, za&scaron;krtnete-li pole
                <b>Použ&iacute;t dopravu</b>. Ne v&scaron;echny regiony v&scaron;ak podporuj&iacute; dopravn&iacute; data. Chcete-li zjistit, zda jsou tato data dostupn&aacute; ve va&scaron;&iacute; oblasti studie, klikněte v tomto n&aacute;stroji na odkaz
                <b>Zobrazit dostupnost</b>.
                
            </p>
        </div>
    </div>
    <div id="OutputNearestLocationsLayer">
        <div><h2>Název výsledné vrstvy</h2></div>
        <hr/>
        <div>
            <p>V&yacute;sledn&eacute; vrstvy budou obsahovat dvě vrstvy: jednu s nejbliž&scaron;&iacute;mi um&iacute;stěn&iacute;mi a druhou s liniemi spojuj&iacute;c&iacute;mi vstupn&iacute; um&iacute;stěn&iacute; s nejbliž&scaron;&iacute;mi um&iacute;stěn&iacute;mi.
            </p>
            <p>Protože linie zn&aacute;zorňuj&iacute; měřen&eacute; cesty, při měřen&iacute; vzd&aacute;lenost&iacute; vzdu&scaron;nou čarou tvoř&iacute; př&iacute;mky, při měřen&iacute; j&iacute;zdn&iacute;ch vzd&aacute;lenost&iacute; tvoř&iacute; nejkrat&scaron;&iacute; trasy po silnic&iacute;ch a při měřen&iacute; dob j&iacute;zdy tvoř&iacute; nejrychlej&scaron;&iacute; trasy po silnic&iacute;ch. Tabulka, kter&aacute; je souč&aacute;st&iacute; voliteln&eacute; vrstvy lini&iacute;, obsahuje n&aacute;sleduj&iacute;c&iacute; informace: měřen&iacute; vzd&aacute;lenosti nebo doby j&iacute;zdy zn&aacute;zorněn&eacute; liniemi; identifikuj&iacute;c&iacute; informace o připojen&yacute;ch poč&aacute;tečn&iacute;ch a koncov&yacute;ch um&iacute;stěn&iacute;ch; a seřazen&yacute; žebř&iacute;ček vzd&aacute;lenost&iacute; rozdělen&yacute; podle poč&aacute;tečn&iacute;ho um&iacute;stěn&iacute;, kter&yacute; zobrazuje prvn&iacute; nejbliž&scaron;&iacute; um&iacute;stěn&iacute;, druh&eacute; nejbliž&scaron;&iacute; um&iacute;stěn&iacute; atd. Při měřen&iacute; doby j&iacute;zdy s použit&iacute;m dopravn&iacute;ch dat obsahuje tabulka tak&eacute; časy odjezdu a př&iacute;jezdu.
            </p>
            <p>Můžete použ&iacute;t v&yacute;choz&iacute; n&aacute;zvy nebo určit nov&eacute; n&aacute;zvy těchto vrstev, kter&eacute; se vytvoř&iacute; ve složce 
                <b>Můj obsah</b> a přidaj&iacute; na mapu. V&yacute;choz&iacute; n&aacute;zvy se ř&iacute;d&iacute; n&aacute;zvem vrstvy anal&yacute;zy. Pokud vrstva již existuje, budete pož&aacute;d&aacute;ni o potvrzen&iacute;, že si přejete ji přepsat.
            </p>
            <p>V&nbsp;rozbalovac&iacute;m seznamu 
                <b>Uložit v&yacute;sledek do</b> můžete zadat n&aacute;zev složky ve složce
                <b>Můj obsah</b>, do kter&eacute; se maj&iacute; v&yacute;sledky uložit.
            </p>
        </div>
    </div>
</div>
</html>
